CSI API ETABS v1

# cSapModelDesignCompositeColumn Property

---

**Namespace:** ETABSv1
**Assembly:** ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (1.27.0.0)

Syntax

C#

VB

C++

F#

Copy

    cDesignCompositeColumn DesignCompositeColumn { get; }

    ReadOnly Property DesignCompositeColumn As cDesignCompositeColumn
    	Get

    Dim instance As cSapModel
    Dim value As cDesignCompositeColumn

    value = instance.DesignCompositeColumn

    property cDesignCompositeColumn^ DesignCompositeColumn {
    	cDesignCompositeColumn^ get ();
    }

    abstract DesignCompositeColumn : cDesignCompositeColumn with get

#### Property Value

Type: cDesignCompositeColumn

See Also

#### Reference

cSapModel Interface

ETABSv1 Namespace

ETABS®, SAFE®, SAP2000® and CSiBridge® are registered trademarks of Computers
and Structures, Inc.

Copyright © Computers and Structures, Inc. 2023. All rights
reserved.

support@csiamerica.com